In [1]:
#WEEK 1 Review INTRO TO PYTHON
#Assigning variables
name = "Filipe"
print("Hi, my name is",name)

Hi, my name is Filipe

In [2]:
# Classifying variable
type(name)

str

In [3]:
# Changing variables from string to float to int
x = "23"
print(x)

x = float(x)
print(x)

x = int(x)
print(x)

23
23.0
23

In [4]:
# Concatenation of strings
str1 = "What's Up"
str2 = "Rick"
print(str1 + str2)
#insert space
print(str1 + " " + str2)
print("How are you, %s" % str2 + "?")

What's UpRick
What's Up Rick
How are you, Rick?

In [5]:
# Creating a list and manipulating the contents
list = ["soccer", "basketball", "football", "baseball"]
print(list[0])
print(list[-3])
x = list[0:2]
y = list[2:]
print(x)
print(y)
list.append("hockey")
print(list)

list.insert(3, "MMA")
print(list)

list.remove("baseball")
del list[2]
list[3] = "boxing"
print(list)

list.reverse()
print(list)

soccer
basketball
['soccer', 'basketball']
['football', 'baseball']
['soccer', 'basketball', 'football', 'baseball', 'hockey']
['soccer', 'basketball', 'football', 'MMA', 'baseball', 'hockey']
['soccer', 'basketball', 'MMA', 'boxing']
['boxing', 'MMA', 'basketball', 'soccer']

In [6]:
"boxing" in list

True

In [7]:
"football" in list

False

In [8]:
len(list)

4

In [9]:
list1 = ["tennis", "golf"]
list.extend(list1)
print(list)

['boxing', 'MMA', 'basketball', 'soccer', 'tennis', 'golf']

In [10]:
# Arithmatic
x = 3
y = 6
x + y

9

In [11]:
x-y

-3

In [12]:
35%3

2

In [13]:
print("%f" %(1.3))
print("%d" %(2.1))

1.300000
2

In [14]:
35//2

17

In [15]:
x = 3
y = 6
z = (x + y)**2 + (y - x) / 3 + 18.1
print(z)
round(z)

100.1

100

In [16]:
f = 5
f == 4

False

In [17]:
f != 4

True

In [18]:
e = 3/1.4
print(complex(e))
print(abs(e))

(2.142857142857143+0j)
2.142857142857143

In [19]:
print(pow(2,2))
print(pow(2,2,3))

4
1

In [20]:
# TUPLES
30,

(30,)

In [21]:
3*(30,)

(30, 30, 30)

In [22]:
toople = tuple([23,54,30])
print(toople)
Toople = tuple("TOOPLE")
print(Toople)
Toople.count("O")

(23, 54, 30)
('T', 'O', 'O', 'P', 'L', 'E')

2

In [23]:
Toople.index("L")

4

In [24]:
# using \n and \t
Week = "mon\ntue\nwed\nthu\nfri\n\tsat\n\tsun"
print(Week)

mon
tue
wed
thu
fri
	sat
	sun

In [25]:
#if, elif, else, for, while, break, continue
for i in range(3):
    print(i)
    if i>=1:
        break

0
1

In [26]:
for i in range(8):
    if i >= 5:
        print("OK")
        continue
    elif i < 5:
        print(i)

0
1
2
3
4
OK
OK
OK

In [27]:
for x in range(12):
    x = x + 1
    if x < 5:
        print("OK")
    elif x > 8:
        print("HI")
    else:
        print(x)

OK
OK
OK
OK
5
6
7
8
HI
HI
HI
HI

In [28]:
#Nested if
a = 1
b = 3
if a > b:
    print("Nope")
elif a < b:
    print("yessir")
    if a == 1:
        print("a is 1, which is less than b AKA 3")
    else:
        print("this isn't getting printed")
else:
    print("doesn't matter")

yessir
a is 1, which is less than b AKA 3

In [29]:
x = 5
while x < 10:
    print(x - 1)
    x = x + 1
print("HI")

4
5
6
7
8
HI

In [30]:
# nested lists
manylists = [[3,4,6], [7,9,12], [14,23,60]]
for list1 in manylists:
    print(list1)

[3, 4, 6]
[7, 9, 12]
[14, 23, 60]

In [31]:
for list1 in manylists:
    for y in list1:
        print(y)

3
4
6
7
9
12
14
23
60

In [32]:
aa = [1,2,3,4,5,6]
max(aa)

6

In [33]:
min(aa)

1

In [34]:
# List Comprehensions
abc = []
for x in range(0,9):
    y = x + 10
    abc.append(y)
print(abc)

[10, 11, 12, 13, 14, 15, 16, 17, 18]

In [35]:
[10 + x for x in range(0,9)]

[10, 11, 12, 13, 14, 15, 16, 17, 18]

In [36]:
[10 + x for x in range(0,9) if x <= 5]

[10, 11, 12, 13, 14, 15]

In [37]:
# WEEK 2 INTRO TO PANDAS: CREATING A DATABASE
import pandas as pd
import numpy as np
import os

In [38]:
%load_ext sql

In [39]:
%sql sqlite://

In [40]:
%%sql
CREATE TABLE RAPPERS(Name varcahr(50),Origin varchar(50),Label varchar(50),ID);
INSERT INTO RAPPERS VALUES("Jay-Z","Brooklyn, NY","Roc Nation","1");
INSERT INTO RAPPERS VALUES("Eminem","Detroit, MI","Shady Records","2");
INSERT INTO RAPPERS VALUES("Kanye West","Chicago, IL", "GOOD Music","3");
INSERT INTO RAPPERS VALUES("Lupe Fiasco","Chicago, IL","1st and 15th","4");
INSERT INTO RAPPERS VALUES("Pusha T","Virginia Beach, VA","GOOD Music","5");

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [41]:
%sql SELECT * from RAPPERS;

 * sqlite://
Done.

[('Jay-Z', 'Brooklyn, NY', 'Roc Nation', '1'),
 ('Eminem', 'Detroit, MI', 'Shady Records', '2'),
 ('Kanye West', 'Chicago, IL', 'GOOD Music', '3'),
 ('Lupe Fiasco', 'Chicago, IL', '1st and 15th', '4'),
 ('Pusha T', 'Virginia Beach, VA', 'GOOD Music', '5')]

In [42]:
#Requesting 'Name' Column
%sql SELECT Name from RAPPERS

 * sqlite://
Done.

[('Jay-Z',), ('Eminem',), ('Kanye West',), ('Lupe Fiasco',), ('Pusha T',)]

In [43]:
#Requesting Name of those from Chicago using Like command %wildcard
%sql SELECT Name from RAPPERS WHERE Origin LIKE 'Chi%';

 * sqlite://
Done.

[('Kanye West',), ('Lupe Fiasco',)]

In [44]:
%sql INSERT INTO RAPPERS VALUES('2Pac','New York City','Death Row Records','6');

 * sqlite://
1 rows affected.

[]

In [45]:
%sql SELECT * from RAPPERS;

 * sqlite://
Done.

[('Jay-Z', 'Brooklyn, NY', 'Roc Nation', '1'),
 ('Eminem', 'Detroit, MI', 'Shady Records', '2'),
 ('Kanye West', 'Chicago, IL', 'GOOD Music', '3'),
 ('Lupe Fiasco', 'Chicago, IL', '1st and 15th', '4'),
 ('Pusha T', 'Virginia Beach, VA', 'GOOD Music', '5'),
 ('2Pac', 'New York City', 'Death Row Records', '6')]

In [46]:
## Creating a DATAFRAME
rap = {'Name': ['Jay-Z', 'Eminem', 'Kanye West', 'Lupe Fiasco', '2Pac', 'Pusha T'],
       'Origin': ['Brooklyn, NY', 'Detroit, MI', 'Chicago, IL', 'Chicago, IL', 'New York City, NY', 'Virginia Beach, VA'],
       'Label': ['Roc Nation', 'Shady Records', 'GOOD Music', '1st and 15th', 'Death Row Records', 'GOOD Music'],
       'Rank': [1, 2, 3, 4, 5, 6]}
df = pd.DataFrame(rap)
df

          Name              Origin              Label  Rank
0        Jay-Z        Brooklyn, NY         Roc Nation     1
1       Eminem         Detroit, MI      Shady Records     2
2   Kanye West         Chicago, IL         GOOD Music     3
3  Lupe Fiasco         Chicago, IL       1st and 15th     4
4         2Pac   New York City, NY  Death Row Records     5
5      Pusha T  Virginia Beach, VA         GOOD Music     6

In [47]:
#Select top 2 rows
df.head(2)

     Name        Origin          Label  Rank
0   Jay-Z  Brooklyn, NY     Roc Nation     1
1  Eminem   Detroit, MI  Shady Records     2

In [48]:
#Set a column as an index
df.set_index('Rank')

             Name              Origin              Label
Rank
1           Jay-Z        Brooklyn, NY         Roc Nation
2          Eminem         Detroit, MI      Shady Records
3      Kanye West         Chicago, IL         GOOD Music
4     Lupe Fiasco         Chicago, IL       1st and 15th
5            2Pac   New York City, NY  Death Row Records
6         Pusha T  Virginia Beach, VA         GOOD Music

In [49]:
# Select column
df['Label']

0           Roc Nation
1        Shady Records
2           GOOD Music
3         1st and 15th
4    Death Row Records
5           GOOD Music
Name: Label, dtype: object

In [50]:
#Select multiple columns
df[['Name', 'Rank']]

          Name  Rank
0        Jay-Z     1
1       Eminem     2
2   Kanye West     3
3  Lupe Fiasco     4
4         2Pac     5
5      Pusha T     6

In [51]:
# Selecting rows via slicing
df[2:4]

          Name       Origin         Label  Rank
2   Kanye West  Chicago, IL    GOOD Music     3
3  Lupe Fiasco  Chicago, IL  1st and 15th     4

In [52]:
#Indexing using .loc to select multiple rows and columns based on title
df.loc['1':'3', ['Name', 'Origin']]

          Name       Origin
1       Eminem  Detroit, MI
2   Kanye West  Chicago, IL
3  Lupe Fiasco  Chicago, IL

In [53]:
#Using .iloc to index
df.iloc[1]

Name             Eminem
Origin      Detroit, MI
Label     Shady Records
Rank                  2
Name: 1, dtype: object

In [54]:
#Using .iloc to select multiple rows and columns using indices
df.iloc[0:3, 0:2]

         Name        Origin
0       Jay-Z  Brooklyn, NY
1      Eminem   Detroit, MI
2  Kanye West   Chicago, IL

In [60]:
# Using .iloc to select 1 cell
df.iloc[0:1, 0:1]

    Name
0  Jay-Z

In [62]:
alphaorder = pd.Series(range(6), index=['Kanye West', 'Jay-Z', 'Lupe Fiasco', 'Eminem', 'Pusha T', '2Pac'])
alphaorder.sort_index()

2Pac           5
Eminem         3
Jay-Z          1
Kanye West     0
Lupe Fiasco    2
Pusha T        4
dtype: int64

In [56]:
#Read and print existing CSV file
auto = pd.read_csv(r'C:\Users\Filipe\Desktop\Back To School\data\auto.csv')
print(auto)

         make  price  mpg  repairs  weight  length  foreign
0         AMC   4099   22        3    2930     186        0
1         AMC   4749   17        3    3350     173        0
2         AMC   3799   22        3    2640     168        0
3        Audi   9690   17        5    2830     189        1
4        Audi   6295   23        3    2070     174        1
5         BMW   9735   25        4    2650     177        1
6       Buick   4816   20        3    3250     196        0
7       Buick   7827   15        4    4080     222        0
8       Buick   5788   18        3    3670     218        0
9       Buick   4453   26        3    2230     170        0
10      Buick   5189   20        3    3280     200        0
11      Buick  10372   16        3    3880     207        0
12      Buick   4082   19        3    3400     200        0
13   Cadillac  11385   14        3    4330     221        0
14   Cadillac  14500   14        2    3900     204        0
15   Cadillac  15906   21        3    4290     204        0
16  Chevrolet   3299   29        3    2110     163        0
17  Chevrolet   5705   16        4    3690     212        0
18  Chevrolet   4504   22        3    3180     193        0
19  Chevrolet   5104   22        2    3220     200        0
20  Chevrolet   3667   24        2    2750     179        0
21  Chevrolet   3955   19        3    3430     197        0
22     Datsun   6229   23        4    2370     170        1
23     Datsun   4589   35        5    2020     165        1
24     Datsun   5079   24        4    2280     170        1
25     Datsun   8129   21        4    2750     184        1

In [59]:
#List the number of cars for each 'make'
auto.make.value_counts()

Buick        7
Chevrolet    6
Datsun       4
Cadillac     3
AMC          3
Audi         2
BMW          1
Name: make, dtype: int64